src/main/java/com/amdocs/halo/automation/xmls/CASO_AVPNSL_QA14_NS.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header>
    <wsse:Security xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="1">
      <wsse:UsernameToken wsu:Id="UsernameToken-15">
        <wsse:Username>OMS</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Oms111</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </soapenv:Header>
  <soapenv:Body>
    <ns0:createAndStartOrder xmlns:ns0="http://CreateAndStartOrder.createAndStartOrder.services.amdocs.com">
      <OrderingContext/>
      <CreateAndStartOrderInput>
        <orderInformationX9>
          <requestingApplicationX9>ROME</requestingApplicationX9>
          <startOrderingProcessX9>N</startOrderingProcessX9>
          <validationModeOnlyX9>N</validationModeOnlyX9>
          <sorlessOrderIndX9>N</sorlessOrderIndX9>
          <tnPlatformInfoX9/>
          <cpeSwapFlagX9>false</cpeSwapFlagX9>
        </orderInformationX9>
        <appointmentInformationX9>
          <customerPurchaseDecisionDateX9>2018-07-05</customerPurchaseDecisionDateX9>
          <customerRefusesEarlyTurnupServiceIndicatorX9>N</customerRefusesEarlyTurnupServiceIndicatorX9>
          <customerRequestDueDateX9>2018-07-05</customerRequestDueDateX9>
          <isInRegionX9>false</isInRegionX9>
        </appointmentInformationX9>
        <customerInformationX9>
          <commonCustomerIdentifierX9>52447020281</commonCustomerIdentifierX9>
          <contractIDX9>15061908</contractIDX9>
        </customerInformationX9>
        <solutionInformation>
          <opportunityEcrmId>55</opportunityEcrmId>
        </solutionInformation>
        <projectInformationX9>
          <foreignSorIdX9>{$sorId$}</foreignSorIdX9>
          <marketStrataX9>0</marketStrataX9>
          <projectIdentifierX9>{$projId$}</projectIdentifierX9>
          <solutionIdentifierX9>48680962</solutionIdentifierX9>
          <typeOfSegmentX9>4</typeOfSegmentX9>
        </projectInformationX9>
        <siteInformationX9>
          <siteIDX9>48879095</siteIDX9>
        </siteInformationX9>
        <updateProductInOrderConfigurationX9>
          <configureNewOfferingX9>
            <productDetailsX9>
              <actionTypeListX9>
                <actionTypeX9 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
              </actionTypeListX9>
              <orderActionTypeX9 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">PR</orderActionTypeX9>
              <productConfigurationChangesX9 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                <changedContainedProductsX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>20079</attributeIDX9>
                    <attributeNameX9>CONTRACTIDENTIFIER</attributeNameX9>
                    <valueX9>15061908</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>20089</attributeIDX9>
                    <attributeNameX9>CTNUMBER</attributeNameX9>
                    <valueX9>NBI1487394</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>20099</attributeIDX9>
                    <attributeNameX9>CONTRACTEDBUSINESSNAME</attributeNameX9>
                    <valueX9>HALOISTCUSTOMERJUL-472</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>20109</attributeIDX9>
                    <attributeNameX9>EFFECTIVEDATE</attributeNameX9>
                    <valueX9>2018-07-05</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>20119</attributeIDX9>
                    <attributeNameX9>CONTRACTTERM</attributeNameX9>
                    <valueX9>24</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>20139</attributeIDX9>
                    <attributeNameX9>CONTRACTSTARTDATE</attributeNameX9>
                    <valueX9>2018-07-04</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>20149</attributeIDX9>
                    <attributeNameX9>CONTRACTENDDATE</attributeNameX9>
                    <valueX9>2018-08-05</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>20159</attributeIDX9>
                    <attributeNameX9>DOCUMENTID</attributeNameX9>
                    <valueX9>148739400</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>72783</attributeIDX9>
                    <attributeNameX9>LEADCOUNTRY</attributeNameX9>
                    <valueX9>US</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>5993525</attributeIDX9>
                    <attributeNameX9>CREDITCHECKAPPROVALNUMBER</attributeNameX9>
                    <valueX9>B0002029341</valueX9>
                  </attributeValueChangeX9>
                  <productSpecContainmentIDX9>72893</productSpecContainmentIDX9>
                  <productSpecContainmentNameX9>AVPNOFFERSITELESS.AVPNSITELESSCONFIGURATION.CONTRACTDETAILS</productSpecContainmentNameX9>
                </changedContainedProductsX9>
                <changedContainedProductsX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>77123</attributeIDX9>
                    <attributeNameX9>TYPEOFTRIPLET</attributeNameX9>
                    <valueX9>S</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>841</attributeIDX9>
                    <attributeNameX9>MASTERCUSTOMERNUMBER</attributeNameX9>
                    <valueX9>30284A</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>861</attributeIDX9>
                    <attributeNameX9>SALESOFFICECODE</attributeNameX9>
                    <valueX9>ED</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>851</attributeIDX9>
                    <attributeNameX9>GROUPCODE</attributeNameX9>
                    <valueX9>VAA</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>14819</attributeIDX9>
                    <attributeNameX9>ACCOUNTNUMBER</attributeNameX9>
                    <valueX9>8310006647258</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>96493</attributeIDX9>
                    <attributeNameX9>ACCOUNTTYPE</attributeNameX9>
                    <valueX9>SA</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>96513</attributeIDX9>
                    <attributeNameX9>BILLERCUSTOMERNAME</attributeNameX9>
                    <valueX9>HALOISTCUSTOMERJUL-472</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>96503</attributeIDX9>
                    <attributeNameX9>BILLERCODE</attributeNameX9>
                    <valueX9>UP</valueX9>
                  </attributeValueChangeX9>
                  <naturalKeyX9>SAS</naturalKeyX9>
                  <productSpecContainmentIDX9>5589315</productSpecContainmentIDX9>
                  <productSpecContainmentNameX9>AVPNOFFERSITELESS.AVPNSITELESSCONFIGURATION.ACCOUNTDETAILS</productSpecContainmentNameX9>
                </changedContainedProductsX9>
                <changedContainedProductsX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>72483</attributeIDX9>
                    <attributeNameX9>ETESITELESSKEY</attributeNameX9>
                    <valueX9>SITLH8843065</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>68283</attributeIDX9>
                    <attributeNameX9>BASESERVICETYPE</attributeNameX9>
                    <valueX9>AVPN</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>67843</attributeIDX9>
                    <attributeNameX9>SERVICEFLAVOR</attributeNameX9>
                    <valueX9>AVPN Express</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>5789895</attributeIDX9>
                    <attributeNameX9>MARKETINGOFFERNAME</attributeNameX9>
                    <valueX9>AVPN Standalone</valueX9>
                  </attributeValueChangeX9>
                  <productSpecContainmentIDX9>72583</productSpecContainmentIDX9>
                  <productSpecContainmentNameX9>AVPNOFFERSITELESS.AVPNSITELESSCONFIGURATION.SITELESSCONFIGMAIN</productSpecContainmentNameX9>
                </changedContainedProductsX9>
                <changedContainedProductsX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>96523</attributeIDX9>
                    <attributeNameX9>BILLINGPLATFORM</attributeNameX9>
                    <valueX9>UB</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>96533</attributeIDX9>
                    <attributeNameX9>GAMSID</attributeNameX9>
                    <valueX9>UB00HA5</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>96543</attributeIDX9>
                    <attributeNameX9>GRUA</attributeNameX9>
                    <valueX9>HALV</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>96553</attributeIDX9>
                    <attributeNameX9>GEMSORGCODE</attributeNameX9>
                    <valueX9>AV_12359001</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>96563</attributeIDX9>
                    <attributeNameX9>GEMSCOMPANYID</attributeNameX9>
                    <valueX9>12359001</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>96573</attributeIDX9>
                    <attributeNameX9>GEMSORGSCHEMA</attributeNameX9>
                    <valueX9>GLOBAL_AM</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>96643</attributeIDX9>
                    <attributeNameX9>ABNINDICATOR</attributeNameX9>
                    <valueX9>Yes</valueX9>
                  </attributeValueChangeX9>
                  <productSpecContainmentIDX9>5595655</productSpecContainmentIDX9>
                  <productSpecContainmentNameX9>AVPNOFFERSITELESS.AVPNSITELESSCONFIGURATION.ACCOUNTDETAILS.ADDITIONALACCOUNTDETAILS</productSpecContainmentNameX9>
                </changedContainedProductsX9>
                <changedContainedProductsX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>9879</attributeIDX9>
                    <attributeNameX9>TECHNICALCONTACTID</attributeNameX9>
                    <valueX9>94</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>9899</attributeIDX9>
                    <attributeNameX9>SALESCONTACTID</attributeNameX9>
                    <valueX9>959</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>9909</attributeIDX9>
                    <attributeNameX9>CUSTOMERCONTACTID</attributeNameX9>
                    <valueX9>96</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>11539</attributeIDX9>
                    <attributeNameX9>ALTERNATECUSTOMERCONTACTID</attributeNameX9>
                    <valueX9>97</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>9919</attributeIDX9>
                    <attributeNameX9>BILLINGCONTACTID</attributeNameX9>
                    <valueX9>98</valueX9>
                  </attributeValueChangeX9>
                  <productSpecContainmentIDX9>74403</productSpecContainmentIDX9>
                  <productSpecContainmentNameX9>AVPNOFFERSITELESS.AVPNSITELESSCONFIGURATION.CONTACTS</productSpecContainmentNameX9>
                </changedContainedProductsX9>
              </productConfigurationChangesX9>
              <productOfferingProductSpecIDX9 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">72703</productOfferingProductSpecIDX9>
              <productOfferingProductSpecNameX9 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">AVPNOFFERSITELESS.AVPNSITELESSCONFIGURATION</productOfferingProductSpecNameX9>
            </productDetailsX9>
            <productDetailsX9 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
              <actionTypeListX9>
                <actionTypeX9 xsi:nil="true"/>
              </actionTypeListX9>
              <orderActionTypeX9>PR</orderActionTypeX9>
              <productConfigurationChangesX9>
                <changedContainedProductsX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>46063</attributeIDX9>
                    <attributeNameX9>ETEVPNKEY</attributeNameX9>
                    <valueX9>VPNH8843066</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>72483</attributeIDX9>
                    <attributeNameX9>ETESITELESSKEY</attributeNameX9>
                    <valueX9>SITLH8843065</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>46073</attributeIDX9>
                    <attributeNameX9>VPNTYPE</attributeNameX9>
                    <valueX9>AVPN</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>46153</attributeIDX9>
                    <attributeNameX9>CUSTOMERVPNNAME</attributeNameX9>
                    <valueX9>9302500724</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>68283</attributeIDX9>
                    <attributeNameX9>BASESERVICETYPE</attributeNameX9>
                    <valueX9>AVPN</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>70043</attributeIDX9>
                    <attributeNameX9>V4MULTICASTINDICATOR</attributeNameX9>
                    <valueX9>No</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>70083</attributeIDX9>
                    <attributeNameX9>V6MULTICASTINDICATOR</attributeNameX9>
                    <valueX9>No</valueX9>
                  </attributeValueChangeX9>
                  <productSpecContainmentIDX9>45353</productSpecContainmentIDX9>
                  <productSpecContainmentNameX9>AVPNOFFERSITELESS.AVPNVPN.VPNMAIN</productSpecContainmentNameX9>
                </changedContainedProductsX9>
                <changedContainedProductsX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>46263</attributeIDX9>
                    <attributeNameX9>GLOBALVPNINDICATOR</attributeNameX9>
                    <valueX9>Global</valueX9>
                  </attributeValueChangeX9>
                  <attributeValueChangeX9>
                    <attributeIDX9>46273</attributeIDX9>
                    <attributeNameX9>CONNECTIONPOLICY</attributeNameX9>
                    <valueX9>Any To Any</valueX9>
                  </attributeValueChangeX9>
                  <productSpecContainmentIDX9>48373</productSpecContainmentIDX9>
                  <productSpecContainmentNameX9>AVPNOFFERSITELESS.AVPNVPN.LAYER3VPNDATA</productSpecContainmentNameX9>
                </changedContainedProductsX9>
              </productConfigurationChangesX9>
              <productOfferingProductSpecIDX9>72723</productOfferingProductSpecIDX9>
              <productOfferingProductSpecNameX9>AVPNOFFERSITELESS.AVPNVPN</productOfferingProductSpecNameX9>
            </productDetailsX9>
            <productOfferingCatalogIDX9 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">72693</productOfferingCatalogIDX9>
            <productOfferingCatalogNameX9 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">AVPNOFFERSITELESS</productOfferingCatalogNameX9>
          </configureNewOfferingX9>
          <runCompatibilityRulesX9 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">true</runCompatibilityRulesX9>
        </updateProductInOrderConfigurationX9>
        <correlationIDX9 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">559879</correlationIDX9>
      </CreateAndStartOrderInput>
    </ns0:createAndStartOrder>
  </soapenv:Body>
</soapenv:Envelope>